; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem prb-242_d26_p-TR3-n36-r1w15o6c9-6) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 - Rover
	rover0store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 waypoint11 waypoint12 waypoint13 waypoint14 - Waypoint
	camera0 camera1 camera2 camera3 camera4 camera5 camera6 camera7 camera8 - Camera
	objective0 objective1 objective2 objective3 objective4 objective5 - Objective
	)
(:init
(visible waypoint0 waypoint4)
(visible waypoint4 waypoint0)
(visible waypoint0 waypoint11)
(visible waypoint11 waypoint0)
(visible waypoint0 waypoint13)
(visible waypoint13 waypoint0)
(visible waypoint1 waypoint0)
(visible waypoint0 waypoint1)
(visible waypoint1 waypoint5)
(visible waypoint5 waypoint1)
(visible waypoint1 waypoint7)
(visible waypoint7 waypoint1)
(visible waypoint1 waypoint12)
(visible waypoint12 waypoint1)
(visible waypoint1 waypoint14)
(visible waypoint14 waypoint1)
(visible waypoint2 waypoint8)
(visible waypoint8 waypoint2)
(visible waypoint2 waypoint11)
(visible waypoint11 waypoint2)
(visible waypoint2 waypoint14)
(visible waypoint14 waypoint2)
(visible waypoint3 waypoint2)
(visible waypoint2 waypoint3)
(visible waypoint3 waypoint7)
(visible waypoint7 waypoint3)
(visible waypoint3 waypoint10)
(visible waypoint10 waypoint3)
(visible waypoint3 waypoint13)
(visible waypoint13 waypoint3)
(visible waypoint3 waypoint14)
(visible waypoint14 waypoint3)
(visible waypoint4 waypoint10)
(visible waypoint10 waypoint4)
(visible waypoint4 waypoint13)
(visible waypoint13 waypoint4)
(visible waypoint4 waypoint14)
(visible waypoint14 waypoint4)
(visible waypoint5 waypoint2)
(visible waypoint2 waypoint5)
(visible waypoint5 waypoint4)
(visible waypoint4 waypoint5)
(visible waypoint5 waypoint11)
(visible waypoint11 waypoint5)
(visible waypoint6 waypoint0)
(visible waypoint0 waypoint6)
(visible waypoint6 waypoint1)
(visible waypoint1 waypoint6)
(visible waypoint6 waypoint3)
(visible waypoint3 waypoint6)
(visible waypoint6 waypoint13)
(visible waypoint13 waypoint6)
(visible waypoint7 waypoint0)
(visible waypoint0 waypoint7)
(visible waypoint7 waypoint12)
(visible waypoint12 waypoint7)
(visible waypoint7 waypoint14)
(visible waypoint14 waypoint7)
(visible waypoint8 waypoint0)
(visible waypoint0 waypoint8)
(visible waypoint8 waypoint1)
(visible waypoint1 waypoint8)
(visible waypoint8 waypoint9)
(visible waypoint9 waypoint8)
(visible waypoint8 waypoint11)
(visible waypoint11 waypoint8)
(visible waypoint9 waypoint0)
(visible waypoint0 waypoint9)
(visible waypoint9 waypoint1)
(visible waypoint1 waypoint9)
(visible waypoint9 waypoint2)
(visible waypoint2 waypoint9)
(visible waypoint9 waypoint3)
(visible waypoint3 waypoint9)
(visible waypoint9 waypoint4)
(visible waypoint4 waypoint9)
(visible waypoint9 waypoint6)
(visible waypoint6 waypoint9)
(visible waypoint9 waypoint7)
(visible waypoint7 waypoint9)
(visible waypoint9 waypoint12)
(visible waypoint12 waypoint9)
(visible waypoint9 waypoint14)
(visible waypoint14 waypoint9)
(visible waypoint10 waypoint1)
(visible waypoint1 waypoint10)
(visible waypoint11 waypoint1)
(visible waypoint1 waypoint11)
(visible waypoint11 waypoint3)
(visible waypoint3 waypoint11)
(visible waypoint11 waypoint6)
(visible waypoint6 waypoint11)
(visible waypoint12 waypoint4)
(visible waypoint4 waypoint12)
(visible waypoint13 waypoint1)
(visible waypoint1 waypoint13)
(visible waypoint13 waypoint5)
(visible waypoint5 waypoint13)
(visible waypoint13 waypoint11)
(visible waypoint11 waypoint13)
(visible waypoint13 waypoint12)
(visible waypoint12 waypoint13)
(visible waypoint14 waypoint0)
(visible waypoint0 waypoint14)
(visible waypoint14 waypoint5)
(visible waypoint5 waypoint14)
(visible waypoint14 waypoint10)
(visible waypoint10 waypoint14)
(visible waypoint14 waypoint12)
(visible waypoint12 waypoint14)
(at_lander general waypoint8)
(store_of rover0store rover0)
(equipped_for_rock_analysis rover0)
(equipped_for_imaging rover0)
(can_traverse rover0 waypoint5 waypoint1)
(can_traverse rover0 waypoint1 waypoint5)
(can_traverse rover0 waypoint5 waypoint2)
(can_traverse rover0 waypoint2 waypoint5)
(can_traverse rover0 waypoint5 waypoint4)
(can_traverse rover0 waypoint4 waypoint5)
(can_traverse rover0 waypoint5 waypoint13)
(can_traverse rover0 waypoint13 waypoint5)
(can_traverse rover0 waypoint5 waypoint14)
(can_traverse rover0 waypoint14 waypoint5)
(can_traverse rover0 waypoint1 waypoint0)
(can_traverse rover0 waypoint0 waypoint1)
(can_traverse rover0 waypoint1 waypoint6)
(can_traverse rover0 waypoint6 waypoint1)
(can_traverse rover0 waypoint1 waypoint7)
(can_traverse rover0 waypoint7 waypoint1)
(can_traverse rover0 waypoint1 waypoint9)
(can_traverse rover0 waypoint9 waypoint1)
(can_traverse rover0 waypoint1 waypoint11)
(can_traverse rover0 waypoint11 waypoint1)
(can_traverse rover0 waypoint2 waypoint3)
(can_traverse rover0 waypoint3 waypoint2)
(can_traverse rover0 waypoint2 waypoint8)
(can_traverse rover0 waypoint8 waypoint2)
(can_traverse rover0 waypoint7 waypoint12)
(can_traverse rover0 waypoint12 waypoint7)
(on_board camera0 rover0)
(calibration_target camera0 objective4)
(supports camera0 colour)
(supports camera0 low_res)
(on_board camera1 rover0)
(calibration_target camera1 objective1)
(supports camera1 colour)
(supports camera1 high_res)
(on_board camera2 rover0)
(calibration_target camera2 objective3)
(supports camera2 high_res)
(supports camera2 low_res)
(on_board camera3 rover0)
(calibration_target camera3 objective1)
(supports camera3 colour)
(supports camera3 low_res)
(on_board camera4 rover0)
(calibration_target camera4 objective4)
(supports camera4 colour)
(supports camera4 high_res)
(supports camera4 low_res)
(on_board camera5 rover0)
(calibration_target camera5 objective4)
(supports camera5 high_res)
(supports camera5 low_res)
(on_board camera6 rover0)
(calibration_target camera6 objective3)
(supports camera6 high_res)
(on_board camera7 rover0)
(calibration_target camera7 objective4)
(supports camera7 colour)
(supports camera7 high_res)
(on_board camera8 rover0)
(calibration_target camera8 objective5)
(supports camera8 colour)
(visible_from objective0 waypoint1)
(visible_from objective1 waypoint1)
(visible_from objective1 waypoint3)
(visible_from objective1 waypoint4)
(visible_from objective1 waypoint6)
(visible_from objective1 waypoint7)
(visible_from objective1 waypoint9)
(visible_from objective1 waypoint12)
(visible_from objective2 waypoint0)
(visible_from objective2 waypoint1)
(visible_from objective2 waypoint3)
(visible_from objective2 waypoint5)
(visible_from objective2 waypoint7)
(visible_from objective2 waypoint8)
(visible_from objective2 waypoint9)
(visible_from objective2 waypoint10)
(visible_from objective2 waypoint12)
(visible_from objective2 waypoint13)
(visible_from objective2 waypoint14)
(visible_from objective3 waypoint7)
(visible_from objective3 waypoint8)
(visible_from objective4 waypoint0)
(visible_from objective4 waypoint1)
(visible_from objective4 waypoint6)
(visible_from objective4 waypoint12)
(visible_from objective5 waypoint1)
(visible_from objective5 waypoint8)
(visible_from objective5 waypoint11)
(visible_from objective5 waypoint14)
(at_soil_sample waypoint0)
(at_rock_sample waypoint0)
(at_soil_sample waypoint1)
(at_rock_sample waypoint2)
(at_rock_sample waypoint3)
(at_soil_sample waypoint4)
(at_soil_sample waypoint5)
(at_rock_sample waypoint7)
(at_soil_sample waypoint9)
(at_rock_sample waypoint9)
(at_soil_sample waypoint10)
(at_rock_sample waypoint10)
(at_soil_sample waypoint12)
(at_rock_sample waypoint12)
(channel_free general)
(available rover0)
(empty rover0store)
(at rover0 waypoint1)
)

(:goal (and
(communicated_rock_data waypoint7)
(communicated_rock_data waypoint9)
(communicated_rock_data waypoint2)
(communicated_image_data objective2 colour)
(communicated_image_data objective1 low_res)
(communicated_image_data objective4 low_res)
(communicated_image_data objective1 high_res)
	)
)
)

; plan
1. (calibrate rover0 camera5 objective4 waypoint1)
   added: (calibrated camera5 rover0)
   goals met: 0 of 7
2. (calibrate rover0 camera8 objective5 waypoint1)
   added: (calibrated camera8 rover0)
   goals met: 0 of 7
3. (take_image rover0 waypoint1 objective2 camera8 colour)
   deleted: (calibrated camera8 rover0)
   added: (have_image rover0 objective2 colour)
   goals met: 0 of 7
4. (communicate_image_data rover0 general objective2 colour waypoint1 waypoint8)
   added: (communicated_image_data objective2 colour)
   goals met: 1 of 7
5. (take_image rover0 waypoint1 objective1 camera5 high_res)
   deleted: (calibrated camera5 rover0)
   added: (have_image rover0 objective1 high_res)
   goals met: 1 of 7
6. (calibrate rover0 camera5 objective4 waypoint1)
   added: (calibrated camera5 rover0)
   goals met: 1 of 7
7. (communicate_image_data rover0 general objective1 high_res waypoint1 waypoint8)
   added: (communicated_image_data objective1 high_res)
   goals met: 2 of 7
8. (take_image rover0 waypoint1 objective1 camera5 low_res)
   deleted: (calibrated camera5 rover0)
   added: (have_image rover0 objective1 low_res)
   goals met: 2 of 7
9. (calibrate rover0 camera5 objective4 waypoint1)
   added: (calibrated camera5 rover0)
   goals met: 2 of 7
10. (take_image rover0 waypoint1 objective4 camera5 low_res)
   deleted: (calibrated camera5 rover0)
   added: (have_image rover0 objective4 low_res)
   goals met: 2 of 7
11. (communicate_image_data rover0 general objective4 low_res waypoint1 waypoint8)
   added: (communicated_image_data objective4 low_res)
   goals met: 3 of 7
12. (communicate_image_data rover0 general objective1 low_res waypoint1 waypoint8)
   added: (communicated_image_data objective1 low_res)
   goals met: 4 of 7
13. (navigate rover0 waypoint1 waypoint7)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint7)
   goals met: 4 of 7
14. (sample_rock rover0 rover0store waypoint7)
   deleted: (empty rover0store) (at_rock_sample waypoint7)
   added: (have_rock_analysis rover0 waypoint7) (full rover0store)
   goals met: 4 of 7
15. (navigate rover0 waypoint7 waypoint1)
   deleted: (at rover0 waypoint7)
   added: (at rover0 waypoint1)
   goals met: 4 of 7
16. (communicate_rock_data rover0 general waypoint7 waypoint1 waypoint8)
   added: (communicated_rock_data waypoint7)
   goals met: 5 of 7
17. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 5 of 7
18. (navigate rover0 waypoint1 waypoint9)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint9)
   goals met: 5 of 7
19. (sample_rock rover0 rover0store waypoint9)
   deleted: (empty rover0store) (at_rock_sample waypoint9)
   added: (have_rock_analysis rover0 waypoint9) (full rover0store)
   goals met: 5 of 7
20. (navigate rover0 waypoint9 waypoint1)
   deleted: (at rover0 waypoint9)
   added: (at rover0 waypoint1)
   goals met: 5 of 7
21. (communicate_rock_data rover0 general waypoint9 waypoint1 waypoint8)
   added: (communicated_rock_data waypoint9)
   goals met: 6 of 7
22. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 6 of 7
23. (navigate rover0 waypoint1 waypoint5)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint5)
   goals met: 6 of 7
24. (navigate rover0 waypoint5 waypoint2)
   deleted: (at rover0 waypoint5)
   added: (at rover0 waypoint2)
   goals met: 6 of 7
25. (sample_rock rover0 rover0store waypoint2)
   deleted: (empty rover0store) (at_rock_sample waypoint2)
   added: (have_rock_analysis rover0 waypoint2) (full rover0store)
   goals met: 6 of 7
26. (communicate_rock_data rover0 general waypoint2 waypoint2 waypoint8)
   added: (communicated_rock_data waypoint2)
   goals met: 7 of 7
